results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf5-isr4-msg102400-tps1000-batch131072-acks1-prod12-compnone-trial3/producer-perf-9.log
producer_index=9
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 16994.0 ms avg latency, 16994.0 ms max latency.
56 records sent, 10.8 records/sec (1.06 MB/sec), 7446.6 ms avg latency, 9362.0 ms max latency.
96 records sent, 18.9 records/sec (1.84 MB/sec), 10262.6 ms avg latency, 13144.0 ms max latency.
150 records sent, 29.3 records/sec (2.86 MB/sec), 12457.0 ms avg latency, 14588.0 ms max latency.
251 records sent, 49.8 records/sec (4.86 MB/sec), 8001.4 ms avg latency, 12013.0 ms max latency.
322 records sent, 64.3 records/sec (6.28 MB/sec), 4020.6 ms avg latency, 5840.0 ms max latency.
401 records sent, 79.8 records/sec (7.79 MB/sec), 3265.5 ms avg latency, 3913.0 ms max latency.
450 records sent, 89.9 records/sec (8.78 MB/sec), 2532.1 ms avg latency, 3215.0 ms max latency.
475 records sent, 94.7 records/sec (9.25 MB/sec), 1260.1 ms avg latency, 2333.0 ms max latency.
389 records sent, 77.3 records/sec (7.55 MB/sec), 236.2 ms avg latency, 753.0 ms max latency.
310 records sent, 61.7 records/sec (6.02 MB/sec), 123.4 ms avg latency, 413.0 ms max latency.
84 records sent, 16.6 records/sec (1.63 MB/sec), 33.6 ms avg latency, 86.0 ms max latency.
146 records sent, 28.9 records/sec (2.82 MB/sec), 32.7 ms avg latency, 101.0 ms max latency.
281 records sent, 55.6 records/sec (5.43 MB/sec), 65.1 ms avg latency, 179.0 ms max latency.
328 records sent, 65.5 records/sec (6.40 MB/sec), 59.9 ms avg latency, 209.0 ms max latency.
348 records sent, 68.8 records/sec (6.72 MB/sec), 85.0 ms avg latency, 236.0 ms max latency.
364 records sent, 72.8 records/sec (7.11 MB/sec), 57.6 ms avg latency, 240.0 ms max latency.
378 records sent, 75.5 records/sec (7.37 MB/sec), 56.8 ms avg latency, 188.0 ms max latency.
369 records sent, 72.9 records/sec (7.12 MB/sec), 107.4 ms avg latency, 537.0 ms max latency.
386 records sent, 76.9 records/sec (7.51 MB/sec), 49.1 ms avg latency, 195.0 ms max latency.
376 records sent, 75.2 records/sec (7.34 MB/sec), 55.2 ms avg latency, 191.0 ms max latency.
370 records sent, 74.0 records/sec (7.23 MB/sec), 42.2 ms avg latency, 240.0 ms max latency.
399 records sent, 79.2 records/sec (7.74 MB/sec), 69.5 ms avg latency, 321.0 ms max latency.
353 records sent, 70.6 records/sec (6.89 MB/sec), 51.8 ms avg latency, 273.0 ms max latency.
379 records sent, 75.8 records/sec (7.40 MB/sec), 49.2 ms avg latency, 174.0 ms max latency.
556 records sent, 111.2 records/sec (10.86 MB/sec), 35.8 ms avg latency, 150.0 ms max latency.
8333 records sent, 57.271478 records/sec (5.59 MB/sec), 1208.65 ms avg latency, 16994.00 ms max latency, 70 ms 50th, 7502 ms 95th, 12518 ms 99th, 13812 ms 99.9th.